Revit 2024 API
TransformWithBoundary Members
The TransformWithBoundary type exposes the following members.
Constructors
Name | Description
TransformWithBoundary
 Constructs a new copy of the input TransformWithBoundary object.
Methods
Name | Description
Dispose
Releases all resources used by the TransformWithBoundary
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetBoundary
 Returns the boundary for the model space to view projection space transform.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetModelToProjectionTransform
 Gets the model space to view projection space transform.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
TransformWithBoundary Class
Autodesk.Revit.DB Namespace